In [1]:
import pandas as pd

In [14]:
df = pd.read_csv('estonia.csv')
df

,PassengerId,Country,Firstname,Lastname,Sex,Age,Category,Survived
0,1,Sweden,ARVID KALLE,AADLI,M,62,P,0
1,2,Estonia,LEA,AALISTE,F,22,C,0
2,3,Estonia,AIRI,AAVASTE,F,21,C,0
3,4,Sweden,JURI,AAVIK,M,53,C,0
4,5,Sweden,BRITTA ELISABET,AHLSTROM,F,55,P,0
...,...,...,...,...,...,...,...,...
984,985,Sweden,ANNA INGRID BIRGITTA,OSTROM,F,60,P,0
985,986,Sweden,ELMAR MIKAEL,OUN,M,34,P,1
986,987,Sweden,ENN,QUNAPUU,M,77,P,0
987,988,Sweden,LY,GUNAPUU,F,87,P,0
988,989,Sweden,CARL,OVBERG,M,42,P,1

In [16]:
piv = df.pivot_table(values = "Lastname",index="Sex",columns="Survived",aggfunc="count")
piv

Survived    0    1
Sex
F         459   27
M         393  110

In [18]:
piv2 = df.pivot_table(values = "Lastname",index="Category",columns="Sex",aggfunc="count")
piv2

Sex         F    M
Category
C         109   84
P         377  419

In [21]:
df.pivot_table(values = "Age",index="Category",columns="Sex",aggfunc="sum")

Sex           F      M
Category
C          3565   2843
P         18557  19120

In [22]:
df.pivot_table(values = "Age",index="Category",columns="Survived",aggfunc="count")

Survived    0   1
Category
C         154  39
P         698  98

In [23]:
df.pivot_table(values = "Age",index="Category",columns="Survived",aggfunc="sum")

Survived      0     1
Category
C          5130  1278
P         34295  3382

In [28]:
df.query('Category=="C" and Sex=="M" and Survived==0').shape[0]

56

In [26]:
df.isnull().any()

PassengerId    False
Country        False
Firstname      False
Lastname       False
Sex            False
Age            False
Category       False
Survived       False
dtype: bool

In [29]:
df.size

7912

In [ ]:
df.shape[0]

In [ ]:
#pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', 
#            fill_value=None, margins=False, dropna=True, margins_name='All', 
#            observed=False, sort=True)

In [ ]:
df.pivot_table(values = "Age",index="Sex",columns="Survived",aggfunc="mean")

In [ ]:
#pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
#                    aggfunc={'D': np.mean,
#                             'E': [min, max, np.mean]})